In [1]:
from src.data import read_raw_data


data = read_raw_data()

In [2]:
data['test'][['Date', 'Trap', 'Species']].shape, data['test'][['Date', 'Trap', 'Species']].drop_duplicates().shape

((116293, 3), (113240, 3))

In [3]:
multirows_test = data['test'].groupby(['Date', 'Trap', 'Species']).Id.count().reset_index().sort_values(by='Id')
multirows_test

             Date  Trap                 Species  Id
75065  2012-07-20  T237           CULEX PIPIENS   1
75078  2012-07-20  T238         CULEX TERRITANS   1
75077  2012-07-20  T238          CULEX TARSALIS   1
75076  2012-07-20  T238        CULEX SALINARIUS   1
75075  2012-07-20  T238          CULEX RESTUANS   1
...           ...   ...                     ...  ..
79850  2012-08-10  T900  CULEX PIPIENS/RESTUANS  13
72882  2012-07-19  T027  CULEX PIPIENS/RESTUANS  16
42898  2010-07-19  T900  CULEX PIPIENS/RESTUANS  21
20250  2008-08-19  T900  CULEX PIPIENS/RESTUANS  23
77466  2012-08-03  T900  CULEX PIPIENS/RESTUANS  26

[113240 rows x 4 columns]

In [4]:
multirows_train = data['train'].groupby(['Date', 'Trap', 'Species']).NumMosquitos.count().reset_index().sort_values(by='NumMosquitos')
multirows_train

            Date  Trap                 Species  NumMosquitos
5536  2011-08-05  T008  CULEX PIPIENS/RESTUANS             1
5551  2011-08-05  T031         CULEX TERRITANS             1
5550  2011-08-05  T031          CULEX RESTUANS             1
5549  2011-08-05  T031  CULEX PIPIENS/RESTUANS             1
5548  2011-08-05  T030          CULEX RESTUANS             1
...          ...   ...                     ...           ...
1196  2007-08-08  T138           CULEX PIPIENS            34
3197  2009-06-22  T900  CULEX PIPIENS/RESTUANS            34
1901  2007-08-28  T115           CULEX PIPIENS            45
565   2007-07-25  T115           CULEX PIPIENS            49
1450  2007-08-16  T115           CULEX PIPIENS            51

[8475 rows x 4 columns]

In [5]:
multirows_test.Id.value_counts()

Id
1     111098
2       1847
3        105
4         61
5         38
6         27
7         24
8         14
10        10
9          7
13         3
11         2
16         1
21         1
23         1
26         1
Name: count, dtype: int64

In [6]:
multirows_train.NumMosquitos.value_counts()

NumMosquitos
1     7720
2      459
3      112
4       46
5       41
6       21
7       20
8       15
9        6
10       6
11       6
13       2
34       2
14       2
17       2
20       2
32       2
12       1
16       1
18       1
22       1
19       1
27       1
25       1
33       1
45       1
49       1
51       1
Name: count, dtype: int64

In [7]:
multi_train = data['train'].groupby(['Date', 'Trap', 'Species']).agg(
    NumRows=('NumMosquitos', 'count'), 
    NumMosquitos=('NumMosquitos', 'sum')
)
multi_train

                                        NumRows  NumMosquitos
Date       Trap Species
2007-05-29 T002 CULEX PIPIENS/RESTUANS        1             1
                CULEX RESTUANS                1             1
           T007 CULEX RESTUANS                1             1
           T015 CULEX PIPIENS/RESTUANS        1             1
                CULEX RESTUANS                1             4
...                                         ...           ...
2013-09-26 T232 CULEX PIPIENS/RESTUANS        1             1
           T233 CULEX PIPIENS/RESTUANS        1             5
           T235 CULEX PIPIENS/RESTUANS        1             1
           T900 CULEX PIPIENS                 4            37
                CULEX PIPIENS/RESTUANS        2            43

[8475 rows x 2 columns]

In [8]:
multi_train.corr()

               NumRows  NumMosquitos
NumRows       1.000000      0.962238
NumMosquitos  0.962238      1.000000

In [9]:
data['train'].shape

(10506, 12)

In [10]:
multirows = data['train'].groupby(['Date', 'Trap', 'Species']).agg(NumRows=('Latitude', 'count')).reset_index()
data['train'] = data['train'].merge(multirows, on=['Date', 'Trap', 'Species'], how='left')

In [12]:
data['train'].shape, multirows.shape

((10506, 13), (8475, 4))